Repository: githubmonkey/sliderpuzzle_flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: de

# settingsLabelCaption
source: Game Settings
de: Einstellungen

# settingsLabelBoardSize
source: Board Size
de: Dimension

# settingsLabelGame
source: Challenge
de: Modus

# languageChangeTooltip
source: Two languages only for simplicity
de: Nur zwei Sprachen zur Einfachheit.

# puzzleChangeTooltip
source: Changing the theme will reset your score
de: Der Spielstand wird zurückgesetzt

# puzzleRestartTooltip
source: Restarting the puzzle will reset your score
de: Der Spielstand wird zurückgesetzt

# mslideTitle
source: Slide & Solve
de: Rechne & schieb

# mslideIntro
source: Only a math wizz can solve this!
de: Das schaffen nur Mathestars!

# mslideExtra
source: TIP: Practice your math with Swap mode. Practice puzzle solving with Simple. Then return here to conquer the math slider.
de: Um erst mal das Rechnen zu üben, fang mit dem Swap-Modus an. Um das Schieben zu lernen, versuch Simple oder Dash.

# mswapTitle
source: Swap & Learn
de: Rechne & tausch

# mswapIntro
source: Focus on your math
de: Hier kannst du das Rechnen üben!

# mswapExtra
source: Do the math, then swap the tiles to solve. Swapping is easier than sliding so start here to practice your math.
de: Tausch Kacheln bis alle Aufgaben gelöst sind.

# simpleTitle
source: Basic Slider
de: Standardpuzzle

# simpleIntro
source: Demo theme, courtesy of VGV
de: Demomodus von VGV

# simpleExtra
source: Slide to solve
de: Hier kannst du schieben

# dashatarTitle
source: Dash Fun
de: Dash Spaß

# dashatarIntro
source: Demo theme, courtesy of VGV
de: Demomodus von VGV

# dashatarExtra
source: Slide to solve
de: Hier kannst du schieben

# puzzleNumberOfMoves
source: Moves
de: Züge

# puzzleNumberOfTilesLeft
source: Tiles
de: Kacheln

# puzzleShuffle
source: Shuffle
de: Mischen

# puzzleCompleted
source: Well done. Congrats!
de: Super. Gut gemacht!

# dashatarStartGame
source: Start Game
de: Starten

# dashatarGetReady
source: Get ready...
de: Und los...

# dashatarRestart
source: Restart
de: Noch einmal

# dashatarCountdownGo
source: GO!
de: LOS!

# dashatarSuccessCompleted
source: Puzzle challenge completed
de: Puzzle gelöst!

# dashatarSuccessWellDone
source: Well done. Congrats!
de: Super! Gut gemacht!

# dashatarSuccessScore
source: Score
de: Ergebnis

# dashatarSuccessNumberOfMoves
source: {numberOfMoves} Moves
de: {numberOfMoves} Züge

# puzzleTileLabelText
source: Value: {value}, position: {x}, {y}
de: Wert: {value}, Position: {x}, {y}

# puzzleTileMathLabelText
source: Problem: {left}x{right}, solution: {answer}, position: {x}, {y}
de: Frage: {left}x{right}, Antwort: {answer}, Position: {x}, {y}

# puzzleNumberOfMovesAndTilesLeftLabelText
source: Moves: {numberOfMoves}, tiles: {tilesLeft}
de: Züge: {numberOfMoves}, Kacheln: {tilesLeft}

# dashatarPuzzleDurationLabelText
source: {hours} hours {minutes} minutes {seconds} seconds
de: {hours} Stunden {minutes} Minuten {seconds} Sekunden

# dashatarSuccessShareYourScoreTitle
source: Share your score!
de: Ergebnis teilen!

# dashatarSuccessShareYourScoreMessage
source: Share this puzzle to challenge your friends and be sure to check out the Flutter Puzzle Hack.
de: Teile das Puzzle und forder Deine Freunde heraus. Schau Dir auch den Flutter Puzzle Hack an.

# dashatarSuccessShareText
source: Just solved the #FlutterPuzzleHack 1x1 puzzle! Check it out ↓
de: Ich hab den #FlutterPuzzleHack geschafft! Guck mal ↓
